# Задача №1
# За день машина проезжает n километров. Сколько дней
# нужно, чтобы проехать иаршрут длинной m километров?
# При решении этой задачи нельзя пользоваться условной 
# инструкцией if и циклами

speed = 700
distance = 750
print((distance + speed - 1) // speed)